app/controllers/movies_controller.rb

            if (params[:ratings] or params[:filter]) # filter ratings
              @movies = Movie.find(:all, :conditions => {:rating => (@filtered_ratings==[] ? @all_ratings : @filtered_ratings)})
            else
              @movies = Movie.all
---
SELECT "movies".* FROM "movies"